/*
  Let the elder help you coding
  Tianyu Yao
  Inspired by console.elder by Tim Holman
*/

(function dothething() {

  if( !window.console ) {
    return;
  }

  window.console.elder = function() {

    var i;
    var elder = [
      '       ,,,,,,,,,                                          ',
      ' ▄▀` └            . `▀▀▀▀▀M▄▄      ▄▄#ÆM▀▀▀▀▀▀▀    ..    `▀▀▀▀▄ ',      
      '╓▓                          ▓▌    ▓⌐                          ▓ ',      
      '▓             ▄▄▄▄▄▄        ▐▓    ▓       ▄▄▓▓▓▄▄,            ▐▌',      
      '▓          ▄▓█▓▓▓  ▀▀█▄     ]▓▓▓▓▓▓µ    ▓█▀█▓█   ▀█▄          ▐▌',      
      '▓      ╙▀▀▀▀   ▀      ▐     ▐▓▓▓▓▓▓▓                          ▐▌',      
      '▓                           ▓▓     ▓µ                         ▐▌',      
      '▓                          ╔▓▀     └▓                         ▓ ',      
      '█▌                         ▓▌       ▐▓                       ▐█ ',      
      ' ▓                       ╓▓▀         └▓▄                    ,▓  ',      
      '  ▀æ▄▄,,             ,,▄▓█             ▀▀╗▄▄,,,,,,,,▄▄▄▄#Æ▀▀▀   ',      
      '             ````  └                                            ',      
      '                         ▄▓▄        ▄▄,                         ',      
      '                        └█▓█`      ╙██▀                         ',      
    ];
    var naive = [
      '   ▄▄       ,▄,      .,         ,▄,  ,▄▄      ╒▓▓µ @▓▓▓▓▓▓▄▄▄ ',          
      '   ▓▓▓▄     ▓▓▌      ▓▓▓µ       ▓▓▌   ▓▓▓     ▓▓█  ▓▓▓▀▀▀▀▀▀▀',           
      '   ▓▓▓▓▓▄   ▓▓▌     ▓▓▓▓▓▄      ▓▓▌   └▓▓▌   ▓▓▓   ▓▓▌       ',           
      '   ▓▓▄▀▓▓▓, ▓▓▌    ▓▓▓ ▐▓▓▓     ▓▓▌    ▐▓▓▄ ▓▓▓    ▓▓▓▓▓▓▓▓▓▓',           
      '   ▓▓▄  ▀▓▓▓▓▓▌   ▓▓▓▓▓▓▓▓▓▓    ▓▓▌     ▐▓▓▓▓▓     ▓▓▌       ',           
      '   ▓▓▄    █▓▓▓▌  ▓▓▓      █▓▓▄  ▓▓▌      ▀▓▓▓▀     ▓▓▓▓▓▓▓▓▄▄',           
      '   ▀▀      ▐██▌ "▀█        ▐██  ██▌       ▀▀`      ▀▀▀▀▀▀▀▀▀▀',           
    ];

    var words = [
      '你们媒体千万要记着，不要“见得风，是得雨”。接到这个消息，你们媒体本身也要判断，明白意思吗？假使这些完全无中生有的东西，你再帮他说一遍，你等于..你也有责任吧',
      '刚才你问我啊，我可以回答你一句“无可奉告”，你们也不高兴，那怎么办？我讲的意思不是我钦点他当下任。你问我支持不支持，我是支持的，我就明确地告诉你这一点',
      '你们啊，我感觉你们新闻界还要学习一个',
      '你们非常熟悉西方的这一套理论，你们毕竟还too young.明白我的意思吧？',
      '我是身经百战了，见得多啦！西方的哪一个国家我没去过？',
      '你们要知道，美国的华莱士，那比你们不知要高到哪里去了，我跟他谈笑风生',
      '所以说媒体呀还是要提高自己的知识水平，识得唔识得啊？唉，我也替你们着急啊，真的',
      '你们有一个好，全世界跑到什么地方，你们比其他的西方记者跑得还快',
      '但是呢问来问的问题呀，都too simple,sometimes naive',
      '我很抱歉，我今天是作为一个长者跟你们讲。我不是新闻工作者，但是我见得太多了。我有这个必要好告诉你们一点人生的经验',
      '刚才我很想啊，我每次碰到你们，我就讲中国有一句话叫“闷声发大财”。我什么话也不说，这是最好的',
      '所以刚才你一定要，在宣传上将来如果你们报道上有偏差，你们要负责',
      '连任也要按照香港的法律啊，对不对',
      '明白这意思吧？你们啊，不要想喜欢弄个大新闻，说现在已经钦定了，就把我批判一番，你们啊 naive！',
      'I am angry！你们这样子是不行的，我今天是得罪了你们一下',
    ];
    // Log the elder!
    for( i = 0; i < elder.length; i++ ) {
      console.log(elder[i] + "\n");
    }
    if (arguments.length) {
      console.log('\n\n');
      console.log.apply(console, arguments);
      console.log('\n\n');
    } else {
      console.log('\n\n\n\n');
    }
    // Some tips
    console.info('+1s', words[Math.round(words.length * Math.random())]);
    // Log the naive
    for( i = 0; i < naive.length; i++ ) {
      console.log(naive[i] + "\n");
    }
  }
})();